---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
source: html/63c56433-ed33-964b-483d-0b121e150d9d.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d

Represents a property consisting of an array of double values.

## Syntax (C#)
```csharp
public class AssetPropertyDoubleArray2d : AssetProperty
```

## Remarks
In virtually all cases, the array will contain exactly 2 values.